
#+STARTUP: overview  //{overview, content, showall}.  Use C-c C-c to change.

** TODO Sweet Example Function
#+NAME: todoOverview
#+BEGIN_SRC emacs-lisp
;; (org-src-debug) ;;< Remove first comment starters to use the debugging code from https://emacs.stackexchange.com/questions/13244/edebug-orgmode-source-code-blocks-with-input-variables
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; The following wrapper enables us to run the code
;; - by evaluating the source code block within the org-file and also
;; - by evaluating the form in the source edit buffer.
(with-current-buffer
    (or (and (org-src-edit-buffer-p) (org-src--source-buffer))
        (current-buffer))
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; The actual code starts here:
  (let* ((ast (org-element-parse-buffer)) ;; built up the abstract syntax tree of the org buffer
         item-types ; all occuring item types. It could be that some task has more item types than another.
         tasks ; accumulation list for the tasks
         current-task ; name of the current task (header of level 1)
         task-items) ; items of the current task
    (org-element-map ast 'headline
      (lambda (hl)
        (cl-case (org-element-property :level hl)
          (1 ; We assume here that headers of level 1 are tasks.
           (when current-task ; registering the old task
             (setq tasks (cons (cons current-task (nreverse task-items)) tasks)))
           (setq current-task (org-element-property :raw-value hl) ; preparing the new task
                 task-items nil))
          (2 ; item
           (let ((item-type (org-element-property :raw-value hl)))
             (setq item-types (cons item-type item-types))
             (setq task-items (cons (cons item-type (org-element-property :todo-keyword hl))
                                    task-items)))))))
    (setq tasks (nreverse (cons (cons current-task (nreverse task-items)) tasks)) ;< add the last task
          item-types (sort (cl-remove-duplicates (nreverse item-types) :test 'string-equal) ; list of unique item types
                           #'string<)) ;;< Sorting the items lexicographical. Other criteria could be applied.
    ;;;;;;;;;;
    ;; generating the output table:
    (apply
     #'list
     (cons "Item" (mapcar #'car tasks)) ; header
     'hline
     ;; rows:
     (mapcar
      ;; mapping the items to the todo states associated to the tasks:
      (lambda (item-type)
        (cons item-type
              (mapcar
               (lambda (task)
                 (let ((todo-status (cdr (assoc-string item-type task))))
                   todo-status))
               tasks)))
      item-types))))
#+END_SRC
#+RESULTS: todoOverview
  | Item | Task 1 [2/2] | Task 2 [1/2] | Task 3 [0/2] |
  |------+--------------+--------------+--------------|
  | I 1  | DONE         | DONE         | TODO         |
  | I 2  | DONE         | TODO         | TODO         |
  | I 3  | nil          | TODO         | nil          |
  |      |              |              |              |
  
** Clocking Work Time
   CLOCK: [2018-03-28 Wed 21:38]--[2018-03-28 Wed 21:43] =>  0:05
   :PROPERTIES:
   :Effort:   0:05
   :END:
Org mode allows you to clock the time you spend on specific tasks in a 
project.

C-c C-x C-i
    Start the clock on the current item (clock-in). This inserts the 
    CLOCK keyword together with a timestamp. When called with a C-u prefix 
    argument, select the task from a list of recently clocked tasks. 
C-c C-x C-o
    Stop the clock (clock-out). This inserts another timestamp at the 
    same location where the clock was last started. It also directly computes 
    the resulting time in inserts it after the time range as ‘=> HH:MM’. 
C-c C-x C-e
    Update the effort estimate for the current clock task. 
C-c C-x C-q
    Cancel the current clock. This is useful if a clock was started by 
    mistake, or if you ended up working on something else. 
C-c C-x C-j
    Jump to the entry that contains the currently running clock. With a C-
    u prefix arg, select the target task from a list of recently clocked tasks. 

C-c C-x C-r
    Insert a dynamic block containing a clock report as an Org-mode table 
    into the current file. When the cursor is at an existing clock table, 
    just update it.
    
    #+BEGIN: clocktable :maxlevel 2 :emphasize nil :scope file
    #+END: clocktable

    For details about how to customize this view, see the manual. 
C-c C-c
    Update dynamic block at point. The cursor needs to be in the #+BEGIN 
    line of the dynamic block. 

The l key may be used in the agenda (see Weekly/daily agenda) to show 
which tasks have been worked on or closed during a day. 

